# FlangeToeOfFillet Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionGeneralT..::..FlangeToeOfFillet Property
StructuralSectionGeneralT Class See Also
---
Detailing distance from center of web to flange toe of fillet, in. (mm)
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public double FlangeToeOfFillet { get; set; }
```

Visual Basic
---
```text
Public Property FlangeToeOfFillet As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double FlangeToeOfFillet {
	double get ();
	void set (double value);
}
```

# See Also
StructuralSectionGeneralT Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace